Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ256DA110.h
#define G1CMDH G1CMDH
extern volatile unsigned int  G1CMDH __attribute__((__sfr__));
typedef struct tagG1CMDHBITS {
  unsigned GCMD16:1;
  unsigned GCMD17:1;
  unsigned GCMD18:1;
  unsigned GCMD19:1;
  unsigned GCMD20:1;
  unsigned GCMD21:1;
  unsigned GCMD22:1;
  unsigned GCMD23:1;
  unsigned GCMD24:1;
  unsigned GCMD25:1;
  unsigned GCMD26:1;
  unsigned GCMD27:1;
  unsigned GCMD28:1;
  unsigned GCMD29:1;
  unsigned GCMD30:1;
  unsigned GCMD31:1;
} G1CMDHBITS;
extern volatile G1CMDHBITS G1CMDHbits __attribute__((__sfr__));

#define G1CON1 G1CON1
extern volatile unsigned int  G1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON1BITS {
  union {
    struct {
      unsigned GCMDCNT:5;
      unsigned PUBPP:3;
      unsigned GCMDWMK:5;
      unsigned G1SIDL:1;
      unsigned :1;
      unsigned G1EN:1;
    };
    struct {
      unsigned GCMDCNT0:1;
      unsigned GCMDCNT1:1;
      unsigned GCMDCNT2:1;
      unsigned GCMDCNT3:1;
      unsigned GCMDCNT4:1;
      unsigned PUBPP0:1;
      unsigned PUBPP1:1;
      unsigned PUBPP2:1;
      unsigned GCMDWMK0:1;
      unsigned GCMDWMK1:1;
      unsigned GCMDWMK2:1;
      unsigned GCMDWMK3:1;
      unsigned GCMDWMK4:1;
    };
  };
} G1CON1BITS;
extern volatile G1CON1BITS G1CON1bits __attribute__((__sfr__));

#define G1STAT G1STAT
extern volatile unsigned int  G1STAT __attribute__((__sfr__));
typedef struct tagG1STATBITS {
  unsigned CMDMPT:1;
  unsigned CMDFUL:1;
  unsigned CMDLV:1;
  unsigned HMRGN:1;
  unsigned VMRGN:1;
  unsigned CHRBUSY:1;
  unsigned RCCBUSY:1;
  unsigned IPUBUSY:1;
  unsigned :7;
  unsigned PUBUSY:1;
} G1STATBITS;
extern volatile G1STATBITS G1STATbits __attribute__((__sfr__));

#define G1IE G1IE
extern volatile unsigned int  G1IE __attribute__((__sfr__));
typedef struct tagG1IEBITS {
  unsigned CMDMPTIE:1;
  unsigned CMDFULIE:1;
  unsigned CMDLVIE:1;
  unsigned HMRGNIE:1;
  unsigned VMRGNIE:1;
  unsigned CHRIE:1;
  unsigned RCCIE:1;
  unsigned IPUIE:1;
  unsigned :7;
  unsigned PUIE:1;
} G1IEBITS;
extern volatile G1IEBITS G1IEbits __attribute__((__sfr__));

#define G1IR G1IR
extern volatile unsigned int  G1IR __attribute__((__sfr__));
typedef struct tagG1IRBITS {
  unsigned CMDMPTIF:1;
  unsigned CMDFULIF:1;
  unsigned CMDLVIF:1;
  unsigned HMRGNIF:1;
  unsigned VMRGNIF:1;
  unsigned CHRIF:1;
  unsigned RCCIF:1;
  unsigned IPUIF:1;
  unsigned :7;
  unsigned PUIF:1;
} G1IRBITS;
extern volatile G1IRBITS G1IRbits __attribute__((__sfr__));

#define G1W1ADRL G1W1ADRL
extern volatile unsigned int  G1W1ADRL __attribute__((__sfr__));
typedef struct tagG1W1ADRLBITS {
  unsigned W1ADR0:1;
  unsigned W1ADR1:1;
  unsigned W1ADR2:1;
  unsigned W1ADR3:1;
  unsigned W1ADR4:1;
  unsigned W1ADR5:1;
  unsigned W1ADR6:1;
  unsigned W1ADR7:1;
  unsigned W1ADR8:1;
  unsigned W1ADR9:1;
  unsigned W1ADR10:1;
  unsigned W1ADR11:1;
  unsigned W1ADR12:1;
  unsigned W1ADR13:1;
  unsigned W1ADR14:1;
  unsigned W1ADR15:1;
} G1W1ADRLBITS;
extern volatile G1W1ADRLBITS G1W1ADRLbits __attribute__((__sfr__));

#define G1W1ADRH G1W1ADRH
extern volatile unsigned int  G1W1ADRH __attribute__((__sfr__));
typedef struct tagG1W1ADRHBITS {
  unsigned W1ADR16:1;
  unsigned W1ADR17:1;
  unsigned W1ADR18:1;
  unsigned W1ADR19:1;
  unsigned W1ADR20:1;
  unsigned W1ADR21:1;
  unsigned W1ADR22:1;
  unsigned W1ADR23:1;
} G1W1ADRHBITS;
extern volatile G1W1ADRHBITS G1W1ADRHbits __attribute__((__sfr__));

#define G1W2ADRL G1W2ADRL
extern volatile unsigned int  G1W2ADRL __attribute__((__sfr__));
typedef struct tagG1W2ADRLBITS {
  unsigned W2ADR0:1;
  unsigned W2ADR1:1;
  unsigned W2ADR2:1;
  unsigned W2ADR3:1;
  unsigned W2ADR4:1;
  unsigned W2ADR5:1;
  unsigned W2ADR6:1;
  unsigned W2ADR7:1;
  unsigned W2ADR8:1;
  unsigned W2ADR9:1;
  unsigned W2ADR10:1;
  unsigned W2ADR11:1;
  unsigned W2ADR12:1;
  unsigned W2ADR13:1;
  unsigned W2ADR14:1;
  unsigned W2ADR15:1;
} G1W2ADRLBITS;
extern volatile G1W2ADRLBITS G1W2ADRLbits __attribute__((__sfr__));

#define G1W2ADRH G1W2ADRH
extern volatile unsigned int  G1W2ADRH __attribute__((__sfr__));
typedef struct tagG1W2ADRHBITS {
  unsigned W2ADR16:1;
  unsigned W2ADR17:1;
  unsigned W2ADR18:1;
  unsigned W2ADR19:1;
  unsigned W2ADR20:1;
  unsigned W2ADR21:1;
  unsigned W2ADR22:1;
  unsigned W2ADR23:1;
} G1W2ADRHBITS;
extern volatile G1W2ADRHBITS G1W2ADRHbits __attribute__((__sfr__));

#define G1PUW G1PUW
extern volatile unsigned int  G1PUW __attribute__((__sfr__));
__extension__ typedef struct tagG1PUWBITS {
  union {
    struct {
      unsigned PUW:11;
    };
    struct {
      unsigned PUW0:1;
      unsigned PUW1:1;
      unsigned PUW2:1;
      unsigned PUW3:1;
      unsigned PUW4:1;
      unsigned PUW5:1;
      unsigned PUW6:1;
      unsigned PUW7:1;
      unsigned PUW8:1;
      unsigned PUW9:1;
      unsigned PUW10:1;
    };
  };
} G1PUWBITS;
extern volatile G1PUWBITS G1PUWbits __attribute__((__sfr__));

#define G1PUH G1PUH
extern volatile unsigned int  G1PUH __attribute__((__sfr__));
__extension__ typedef struct tagG1PUHBITS {
  union {
    struct {
      unsigned PUH:11;
    };
    struct {
      unsigned PUH0:1;
      unsigned PUH1:1;
      unsigned PUH2:1;
      unsigned PUH3:1;
      unsigned PUH4:1;
      unsigned PUH5:1;
      unsigned PUH6:1;
      unsigned PUH7:1;
      unsigned PUH8:1;
      unsigned PUH9:1;
      unsigned PUH10:1;
    };
  };
} G1PUHBITS;
extern volatile G1PUHBITS G1PUHbits __attribute__((__sfr__));

#define G1DPADRL G1DPADRL
extern volatile unsigned int  G1DPADRL __attribute__((__sfr__));
typedef struct tagG1DPADRLBITS {
  unsigned DPADR0:1;
  unsigned DPADR1:1;
  unsigned DPADR2:1;
  unsigned DPADR3:1;
  unsigned DPADR4:1;
  unsigned DPADR5:1;
  unsigned DPADR6:1;
  unsigned DPADR7:1;
  unsigned DPADR8:1;
  unsigned DPADR9:1;
  unsigned DPADR10:1;
  unsigned DPADR11:1;
  unsigned DPADR12:1;
  unsigned DPADR13:1;
  unsigned DPADR14:1;
  unsigned DPADR15:1;
} G1DPADRLBITS;
extern volatile G1DPADRLBITS G1DPADRLbits __attribute__((__sfr__));

#define G1DPADRH G1DPADRH
extern volatile unsigned int  G1DPADRH __attribute__((__sfr__));
typedef struct tagG1DPADRHBITS {
  unsigned DPADR16:1;
  unsigned DPADR17:1;
  unsigned DPADR18:1;
  unsigned DPADR19:1;
  unsigned DPADR20:1;
  unsigned DPADR21:1;
  unsigned DPADR22:1;
  unsigned DPADR23:1;
} G1DPADRHBITS;
